# DSelectAll

## Description
Procedure DSelectAll deselects all selected visible objects on the active layer of a Vectorworks document. If Layer Options is set to Show-Snap-Modify Others, then DSelectAll will deselect all selected visible objects within the document.&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE DSelectAll;
```

```python

def vs.DSelectAll():
    return None
```

## Version
Availability: from MiniCAD
## Category
* Selection